In [1]:
import pandas as pd
import numpy as np
import sqlite3 as sql

In [2]:
database = "movies.sqlite"
connection = sql.connect(database)

In [5]:
query = '''select m.id, d.name, m.original_title, m.budget, m.popularity, m.revenue, m.vote_average, m.vote_count from movies m join directors d on m.uid = d.uid;'''

In [6]:
df = pd.read_sql(query,connection,index_col='id')
df.head()

,name,original_title,budget,popularity,revenue,vote_average,vote_count
id,,,,,,,
43602,Wally Pfister,Spider-Man 3,258000000,115,890871626,5.9,3576
43655,Barry Sonnenfeld,Rush Hour 3,140000000,22,258022233,6.1,783
43665,Steven E. de Souza,Iron Man,140000000,120,585174222,7.4,8776
43736,Guy Ritchie,Mission: Impossible III,150000000,63,397850012,6.5,2028
43747,Hayao Miyazaki,Men in Black II,140000000,91,441818803,6.0,3114